package com.robosh.basestartapplication.net.data

import com.robosh.basestartapplication.model.Comment
import com.robosh.basestartapplication.model.Course
import com.robosh.basestartapplication.model.Lesson
import com.robosh.basestartapplication.model.User
import java.util.*

val registeredUser = User(
    "1",
    "orestshemelyuk@gmail.com",
    "+380976970365",
    "Орест",
    "Шемелюк",
    "https://pickaface.net/gallery/avatar/61351514_190214_2250_pzs6fiz.png",
    null,
    null
)

val coursesList = mutableListOf<Course>().apply {
    add(
        Course(
            "1", "Java",
            "Базовий курс Java призначений для студентів, які хочуть навчитися програмуванню на Java з нуля." +
                    " В ході уроків ви навчитеся розробці та налаштування додатків, " +
                    "познайомитесь із основними елементами технології та конструкціями мови Java Standard Edition.",
            "https://lviv.itea.ua/wp-content/uploads/2020/10/prodvynut%D1%8Bj-kurs-java.png",
            "4.5", null, listOf(
                Lesson(
                    "1",
                    "1",
                    "Загальна характеристика мови Java",
                    180,
                    "Історія мови Java\n" +
                            "Байт-код\n" +
                            "Віртуальна машина Java (JVM)\n" +
                            "Трансляція, інтерпретація і компіляція\n" +
                            "JIT-компіляція\n" +
                            "JDK і його структура\n" +
                            "Команди JDK: javac, java, appletviewer, jar (en10), їх використання і параметри\n" +
                            "Пошук та завантаження класів\n" +
                            "Створення і запуск першої програми на Java\n" +
                            "Вихід з програми і завершення її роботи\n" +
                            "Використання IDE Eclipse / NetBeans / Intellij IDEA для створення і виконання програм",
                    "https://upload.wikimedia.org/wikipedia/uk/8/85/%D0%9B%D0%BE%D0%B3%D0%BE%D1%82%D0%B8%D0%BF_Java.png",
                    "pCJsAzWecbk",
                    listOf(
                        Comment("1","Дуже цікавий урок!","Орест Шемелюк"),
                        Comment("2", "Дійсно унікальний матеріал", "Нікіта Бортнічук", "https://i.pinimg.com/originals/51/f6/fb/51f6fb256629fc755b8870c801092942.png")
                    ),
                    Date(System.currentTimeMillis() + 86400000)
                ),
                Lesson(
                    "2",
                    "2",
                    "Типи даних і основні операції з ними",
                    200,
                    "Алфавіт мови\n" +
                            "Коментарі\n" +
                            "Ключові слова\n" +
                            "Типи даних: прості (примітивні) і по посиланню\n" +
                            "Ідентифікатори, вибір імен ідентифікаторів\n" +
                            "Змінні і константи\n" +
                            "Оголошення і ініціалізація змінних\n" +
                            "Область видимості і час життя змінних",
                    "https://i.ytimg.com/vi/fGta43iNjNM/maxresdefault.jpg",
                    "S1GVLezqYoE",
                    listOf(
                        Comment("3", "Хотілося б трохи більше інформації..", "Андрій Прокопчук"),
                        Comment("4","Топчик!", "Іван Петриченко")
                    ),
                    Date(System.currentTimeMillis() + 186400000)
                ),
                Lesson(
                    "3",
                    "3",
                    "Введення в ООП. Об'єкти і класи",
                    240,
                    "Поля і методи (визначення, синтаксис оголошення)\n" +
                            "Специфікатори доступу public і private\n" +
                            "Поля класів: ініціалізація явна і за замовчуванням, специфікатор final і константи\n" +
                            "Доступ до полів і методів\n" +
                            "Методи: параметри (посилання і прості типи) і ті, що повертаються, використання set і get- методів, перезавантаження методів, правила перезавантаження\n" +
                            "Об'єктна модель. Основні положення: абстрагування, інкапсуляція, модульність, ієрархія",
                    "https://i1.wp.com/java-master.com/wp-content/uploads/2017/05/3whales-oop.png",
                    "EvGi6XDgV7w",
                    listOf(
                        Comment("5", "Класна картинка курсу!", "Шакіла Оніл"),
                        Comment("6", "Корисний урок)", "Кріштіану Роналду")
                    ),
                    Date(System.currentTimeMillis() + 286400000)
                )
            ),
            listOf(
                Comment("7",
                "Хлопці та дівчата, я вам одразу скажу: вчитися по книгах майже нереально, по відео трохи легше." +
                        " Але найголовніше – ви не можете собі поставити задачу відповідно до ваших знань." +
                        " А тут їх багато, дуже багато. Писати на Java для вас стане як керувати авто: " +
                        "багато що натренується до автоматизму.", "Олексій Іванчук", "https://miro.medium.com/max/600/1*PiHoomzwh9Plr9_GA26JcA.png"),
                Comment("8", "Прекрасний ресурс, чудовий проект. Я, дорослий, успішний розробник з 12 річним стажем, занурився в \"гру\" з головою і задоволенням, як у якості \"серіалу\". Всім успіхів! ",
                    "Олександр Олександров", "https://www.pngkey.com/png/detail/114-1149878_setting-user-avatar-in-specific-size-without-breaking.png")
            ),
            "15-04-2021"
        )
    )
    add(
        Course(
            "2", "Курс PHP базовий",
            "Курс PHP базовий — ефективна система, за допомогою якої ви зрозумієте суть PHP менш ніж за два місяці.Мова PHP є однією з найбільш популярних для web-розробки." +
                    " Wikipedia, Facebook та інтернет-магазини — це її заслуга. " +
                    "Протягом навчання ви попрацюєте зі справжніми проектами та напишете свій перший “чистий” код. " +
                    "Після завершення курсу ти будеш орієнтуватися в синтаксисі мови PHP, розуміти особливості back end-розробки, працювати з cookie та sessions. " +
                    "Ти самостійно розробиш невеликий проект та підготуєшся до вивчення більш поглиблених аспектів розробки на PHP.",
            "https://media.proglib.io/wp-uploads/2018/07/d342e70b000d2961a2932.png",
            "5.0", null, listOf(
                Lesson(
                    "4", "1", "WEB-додатки і роль мови php в роботі з ними", 80,
                    "Як влаштований інтернет;\n" +
                            "Клієнт-серверна архітектура;\n" +
                            "Налаштування ПО.",
                    "https://www.seowebsitedesign.com/wp-content/uploads/2012/12/Web_development.jpg",
                    null,
                    listOf(Comment("9", "Супер клас!", "Ліонеля Мессі"),
                        Comment("10", "Супер пупер дупер", "Романченко Геннадій")
                    ),
                    Date(System.currentTimeMillis() + 386400000)
                ),
                Lesson(
                    "5", "2", "Основи мови PHP", 120,
                    "Змінні, константи;\n" +
                            "Вирази, оператори;\n" +
                            "Типи даних та приведення типів;\n" +
                            "Керуючі конструкції.",
                    "https://blog.ukrnames.com/wp-content/uploads/2018/02/v.jpg",
                    null,
                    listOf(
                        Comment("11","Хороший урок.", "Мірошниченко Георгій"),
                        Comment("12","Дуже пізнавально", "Васильєв Кирил")
                    ),
                    Date(System.currentTimeMillis() + 486400000)
                )
            ),
            listOf(
                Comment("13","Пройшов курси php.Всім задоволений.Заняття були насиченими, " +
                        "було багато практики, що є великим плюсом, сподобалась командна робота над проектом, " +
                        "інструктор завжди старається подати інформацію зрозумілою мовою. " +
                        "Хотів би порекомендувати курси ітеа усім хто хоче навчитись програмувати.", "Боднаренко Мирослав")
            ),
            "01-05-2021"
        )
    )
    add(
        Course(
            "3", "С++",
            "Якщо Ви бажаєте програмувати, але не можете визначитися з мовою її особливостями і т.д. пропонуємо курси Основ програмування, на яких розглядаються загальні питання по програмуванню. Мета цього курсу дати учневі базові навички програмування та допомогти визначитися який напрям найбільш цікавий для нього! Курси C++ націлені на отримання знань і практичних навиків програмування на мовах C і C++ в рамках процедурно-орієнтованого програмування, об’єктно-орієнтованого програмування (ООП) та узагальненого програмування із використанням шаблонів. Особлива увага приділяється філософії об’єктно-орієнтованого програмування, оволодінню методами ООП в середовищах Visual C++, Eclipse, Code::Blocks із використанням сучасних компіляторів.",
            "https://res.cloudinary.com/practicaldev/image/fetch/s--3u1aWUCM--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/i/stfvlecgmmp4dso3v0iv.jpg",
            "4.7", null, listOf(
                Lesson(
                    "6", "1", "Синтаксичні примітиви мови", 90,
                    "- Система типів С++. Фундаментальні типи даних;\n" +
                            "- Оголошення та визначення, області видимості;\n" +
                            "- Структура оголошень сутностей програми;\n" +
                            "- Літерали;\n" +
                            "- Змінні та констант, їх ініціалізація;\n" +
                            "- Lvalue, rvalue;\n" +
                            "- Перерахування (enum);\n" +
                            "- Огляд оголошення функцій, структур, об’єднань, класів;\n" +
                            "- Принцип роботи інструкцій (statements);\n" +
                            "- Оператори С++;\n" +
                            "- Пріоритети та асоціативність операторів;\n" +
                            "- Інструкції керування потоком виконання. if, оператор вибору ?:, switch;\n" +
                            "- Цикли while, do-while, for, команди break та continue;",
                    "https://i.pinimg.com/564x/3e/49/c6/3e49c6e72482af5cb5c7bf296af91a46.jpg",
                    null, listOf(
                        Comment("14","Урок просто топ!", "Людмила Крамарчук")
                    ),
                    Date(System.currentTimeMillis() + 486400000)
                ),
                Lesson(
                    "7", "2", "Структури, об’єднання, класи, динамічне ООП", 150,
                    " Структури;\n" +
                            "- Об’єднання;\n" +
                            "- Поняття класу, поля даних та методи;\n" +
                            "- Конструктор, деструктор, конструктор по замовчуванню;\n" +
                            "- Вказівник this, константні методи;\n" +
                            "- Статичні дані та методи класу;\n" +
                            "- Інкапсуляція;\n" +
                            "- Друзі класу;\n" +
                            "- Успадкування, принцип підстановки;\n" +
                            "- Публічне (відкрите) успадкування, як реалізація принципу «нащадок є предком»;\n" +
                            "- Приватне успадкування – успадкування реалізації, з наданням іншого інтерфейсу;\n" +
                            "- Поліморфізм, віртуальні функції;\n" +
                            "- Абстрактні класи;\n" +
                            "- Принципи побудови ієрархії класів;\n" +
                            "- Паттерн проектування NVI (Non-Virtual Interface);\n" +
                            "- Ідіома «віртуального конструктора»;\n" +
                            "- Множинне успадкування, віртуальні базові класи;\n" +
                            "- Неявно створювані методи класу;\n" +
                            "- Узгодженість копіювання-створення-знищення-(переміщення для С++11);\n" +
                            "- Перевантаження операторів. Синтаксис і правила застосування;\n" +
                            "- Конструктори з одним аргументом, explicit;\n" +
                            "- Оператори неявного приведення типів.",
                    "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/OOP.svg/1280px-OOP.svg.png",
                    null, listOf(
                        Comment("15","Нарешті достпуно пояснили ООП.", "Катерина Іванченко")
                    ),
                    Date(System.currentTimeMillis() + 586400000)
                )
            ),
            listOf(
                Comment("16","Вітаю! Днями закінчив курс C ++. Що чекав від курсу? " +
                        "Можливість закласти якийсь фундамент у даному напрямку, " +
                        "щоб в подальшому була можливість, вивчаючи матеріал і практикуючись, рости." +
                        " Я вважаю, що мої надії виправдалися і я отримав бажане. Плюс до цього я познайомився з цікавими людьми," +
                        " з якими ми і осягали ази) Що стосується викладача, то ставлю великий, " +
                        "жирний плюс (Антон Водостоев). Людина є чинним програмістом з великим досвідом роботи." +
                        " Пояснить, розповість, покаже, аби \"посміхалися\". Спасибі хлопцям, які допомагали в " +
                        "проведенні занять. Людям, які в даний момент знаходяться на роздоріжжі, " +
                        "звичайно ж раджу пройти цей курс. Спасибі, був радий знайомству :)", "Ілля Боднаренко")
            ),
            "09-05-2021"
        )
    )
    add(
        Course(
            "4", "Python development",
            "Курс Python — комплексна програма навчання високорівневої мови програмування python (вимовляється «пайтон», але частіше – «пітон»).  Мова програмування python орієнтована на підвищення продуктивності фронтенда і читабельності його коду. Python простий у використанні, але в той же час його бібліотека налічує великий вибір корисних функцій, необхідних для створення веб-дизайну.",
            "https://mk0setscholarsn9sko6.kinstacdn.com/wp-content/uploads/2020/07/PythonProgramming.jpeg",
            "4.6", null, listOf(
                Lesson(
                    "8", "1", "Змінні, вирази і інструкції python", 140,
                    "Поняття «значення» і «тип»\n" +
                            "Змінні\n" +
                            "Імена змінних і ключові (зарезервовані) слова\n" +
                            "Оператори\n" +
                            "Оператори і операнди\n" +
                            "Вирази\n" +
                            "Порядок операцій\n" +
                            "Термінові операції\n" +
                            "Ввід даних",
                    "https://cdn.educba.com/academy/wp-content/uploads/2019/11/Python-Variables-.png",
                    null, listOf(
                        Comment("17","Урок дуже сподобався)", "Тимофій Микитюк")
                    ),
                    Date(System.currentTimeMillis() + 586400000)
                ),
                Lesson(
                    "9", "2", "Управління потоком виконання", 95,
                    "Логічні вирази\n" +
                            "Логічні оператори\n" +
                            "Умовне виконання\n" +
                            "Послідовність умов\n" +
                            "Вкладені умови\n" +
                            "Перехоплення винятків з використанням try і except\n" +
                            "Вправи",
                    "https://cdn.educba.com/academy/wp-content/uploads/2019/10/Do-While-Loop-in-Python-1.png",
                    null, listOf(
                        Comment("18", "Норм, але нудновато", "Таращук Олександр")
                    ),
                    Date(System.currentTimeMillis() + 686400000)
                )
            ),
            listOf(
                Comment("19",
                    "Добре структурована програма з великою кількістю прикладів і практичних завдань. " +
                            "Індивідуальний підхід до кожного з студентів плюс можна було ще поставити питання менторові " +
                            "(якщо щось було не зрозуміло). Так що рекомендую!)))", "Шинкаренко Тимофій")
            ),
            "31-05-2021"
        )
    )
//    ------------------------------------------------------------------------
    Course(
        "5", "Java",
        "Базовий курс Java призначений для студентів, які хочуть навчитися програмуванню на Java з нуля." +
                " В ході уроків ви навчитеся розробці та налаштування додатків, " +
                "познайомитесь із основними елементами технології та конструкціями мови Java Standard Edition.",
        "https://lviv.itea.ua/wp-content/uploads/2020/10/prodvynut%D1%8Bj-kurs-java.png",
        "4.5", null, listOf(
            Lesson(
                "1",
                "1",
                "Загальна характеристика мови Java",
                180,
                "Історія мови Java\n" +
                        "Байт-код\n" +
                        "Віртуальна машина Java (JVM)\n" +
                        "Трансляція, інтерпретація і компіляція\n" +
                        "JIT-компіляція\n" +
                        "JDK і його структура\n" +
                        "Команди JDK: javac, java, appletviewer, jar (en10), їх використання і параметри\n" +
                        "Пошук та завантаження класів\n" +
                        "Створення і запуск першої програми на Java\n" +
                        "Вихід з програми і завершення її роботи\n" +
                        "Використання IDE Eclipse / NetBeans / Intellij IDEA для створення і виконання програм",
                "https://upload.wikimedia.org/wikipedia/uk/8/85/%D0%9B%D0%BE%D0%B3%D0%BE%D1%82%D0%B8%D0%BF_Java.png",
                null,
                listOf(
                    Comment("1","Дуже цікавий урок!","Орест Шемелюк"),
                    Comment("2", "Дійсно унікальний матеріал", "Нікіта Бортнічук")
                ),
                Date(System.currentTimeMillis() + 86400000)
            ),
            Lesson(
                "2",
                "2",
                "Типи даних і основні операції з ними",
                200,
                "Алфавіт мови\n" +
                        "Коментарі\n" +
                        "Ключові слова\n" +
                        "Типи даних: прості (примітивні) і по посиланню\n" +
                        "Ідентифікатори, вибір імен ідентифікаторів\n" +
                        "Змінні і константи\n" +
                        "Оголошення і ініціалізація змінних\n" +
                        "Область видимості і час життя змінних",
                "https://i.ytimg.com/vi/fGta43iNjNM/maxresdefault.jpg",
                null,
                listOf(
                    Comment("3", "Хотілося б трохи більше інформації..", "Андрій Прокопчук"),
                    Comment("4","Топчик!", "Іван Петриченко")
                ),
                Date(System.currentTimeMillis() + 186400000)
            ),
            Lesson(
                "3",
                "3",
                "Введення в ООП. Об'єкти і класи",
                240,
                "Поля і методи (визначення, синтаксис оголошення)\n" +
                        "Специфікатори доступу public і private\n" +
                        "Поля класів: ініціалізація явна і за замовчуванням, специфікатор final і константи\n" +
                        "Доступ до полів і методів\n" +
                        "Методи: параметри (посилання і прості типи) і ті, що повертаються, використання set і get- методів, перезавантаження методів, правила перезавантаження\n" +
                        "Об'єктна модель. Основні положення: абстрагування, інкапсуляція, модульність, ієрархія",
                "https://i1.wp.com/java-master.com/wp-content/uploads/2017/05/3whales-oop.png",
                null,
                listOf(
                    Comment("5", "Класна картинка курсу!", "Шакіла Оніл"),
                    Comment("6", "Корисний урок)", "Кріштіану Роналду")
                ),
                Date(System.currentTimeMillis() + 286400000)
            )
        ),
        listOf(
            Comment("7",
                "Хлопці та дівчата, я вам одразу скажу: вчитися по книгах майже нереально, по відео трохи легше." +
                        " Але найголовніше – ви не можете собі поставити задачу відповідно до ваших знань." +
                        " А тут їх багато, дуже багато. Писати на Java для вас стане як керувати авто: " +
                        "багато що натренується до автоматизму.", "Олексій Іванчук"),
            Comment("8", "Прекрасний ресурс, чудовий проект. Я, дорослий, успішний розробник з 12 річним стажем, занурився в \"гру\" з головою і задоволенням, як у якості \"серіалу\". Всім успіхів! ",
                "Олександр Олександров")
        ),
        "15-04-2021"
    )
    add(
        Course(
            "6", "Курс PHP базовий",
            "Курс PHP базовий — ефективна система, за допомогою якої ви зрозумієте суть PHP менш ніж за два місяці.Мова PHP є однією з найбільш популярних для web-розробки." +
                    " Wikipedia, Facebook та інтернет-магазини — це її заслуга. " +
                    "Протягом навчання ви попрацюєте зі справжніми проектами та напишете свій перший “чистий” код. " +
                    "Після завершення курсу ти будеш орієнтуватися в синтаксисі мови PHP, розуміти особливості back end-розробки, працювати з cookie та sessions. " +
                    "Ти самостійно розробиш невеликий проект та підготуєшся до вивчення більш поглиблених аспектів розробки на PHP.",
            "https://media.proglib.io/wp-uploads/2018/07/d342e70b000d2961a2932.png",
            "5.0", null, listOf(
                Lesson(
                    "4", "1", "WEB-додатки і роль мови php в роботі з ними", 80,
                    "Як влаштований інтернет;\n" +
                            "Клієнт-серверна архітектура;\n" +
                            "Налаштування ПО.",
                    "https://www.seowebsitedesign.com/wp-content/uploads/2012/12/Web_development.jpg",
                    null,
                    listOf(Comment("9", "Супер клас!", "Ліонеля Мессі"),
                        Comment("10", "Супер пупер дупер", "Романченко Геннадій")
                    ),
                    Date(System.currentTimeMillis() + 386400000)
                ),
                Lesson(
                    "5", "2", "Основи мови PHP", 120,
                    "Змінні, константи;\n" +
                            "Вирази, оператори;\n" +
                            "Типи даних та приведення типів;\n" +
                            "Керуючі конструкції.",
                    "https://blog.ukrnames.com/wp-content/uploads/2018/02/v.jpg",
                    null,
                    listOf(
                        Comment("11","Хороший урок.", "Мірошниченко Георгій"),
                        Comment("12","Дуже пізнавально", "Васильєв Кирил")
                    ),
                    Date(System.currentTimeMillis() + 486400000)
                )
            ),
            listOf(
                Comment("13","Пройшов курси php.Всім задоволений.Заняття були насиченими, " +
                        "було багато практики, що є великим плюсом, сподобалась командна робота над проектом, " +
                        "інструктор завжди старається подати інформацію зрозумілою мовою. " +
                        "Хотів би порекомендувати курси ітеа усім хто хоче навчитись програмувати.", "Боднаренко Мирослав")
            ),
            "01-05-2021"
        )
    )
    add(
        Course(
            "7", "С++",
            "Якщо Ви бажаєте програмувати, але не можете визначитися з мовою її особливостями і т.д. пропонуємо курси Основ програмування, на яких розглядаються загальні питання по програмуванню. Мета цього курсу дати учневі базові навички програмування та допомогти визначитися який напрям найбільш цікавий для нього! Курси C++ націлені на отримання знань і практичних навиків програмування на мовах C і C++ в рамках процедурно-орієнтованого програмування, об’єктно-орієнтованого програмування (ООП) та узагальненого програмування із використанням шаблонів. Особлива увага приділяється філософії об’єктно-орієнтованого програмування, оволодінню методами ООП в середовищах Visual C++, Eclipse, Code::Blocks із використанням сучасних компіляторів.",
            "https://res.cloudinary.com/practicaldev/image/fetch/s--3u1aWUCM--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/i/stfvlecgmmp4dso3v0iv.jpg",
            "4.7", null, listOf(
                Lesson(
                    "6", "1", "Синтаксичні примітиви мови", 90,
                    "- Система типів С++. Фундаментальні типи даних;\n" +
                            "- Оголошення та визначення, області видимості;\n" +
                            "- Структура оголошень сутностей програми;\n" +
                            "- Літерали;\n" +
                            "- Змінні та констант, їх ініціалізація;\n" +
                            "- Lvalue, rvalue;\n" +
                            "- Перерахування (enum);\n" +
                            "- Огляд оголошення функцій, структур, об’єднань, класів;\n" +
                            "- Принцип роботи інструкцій (statements);\n" +
                            "- Оператори С++;\n" +
                            "- Пріоритети та асоціативність операторів;\n" +
                            "- Інструкції керування потоком виконання. if, оператор вибору ?:, switch;\n" +
                            "- Цикли while, do-while, for, команди break та continue;",
                    "https://i.pinimg.com/564x/3e/49/c6/3e49c6e72482af5cb5c7bf296af91a46.jpg",
                    null, listOf(
                        Comment("14","Урок просто топ!", "Людмила Крамарчук")
                    ),
                    Date(System.currentTimeMillis() + 486400000)
                ),
                Lesson(
                    "7", "2", "Структури, об’єднання, класи, динамічне ООП", 150,
                    " Структури;\n" +
                            "- Об’єднання;\n" +
                            "- Поняття класу, поля даних та методи;\n" +
                            "- Конструктор, деструктор, конструктор по замовчуванню;\n" +
                            "- Вказівник this, константні методи;\n" +
                            "- Статичні дані та методи класу;\n" +
                            "- Інкапсуляція;\n" +
                            "- Друзі класу;\n" +
                            "- Успадкування, принцип підстановки;\n" +
                            "- Публічне (відкрите) успадкування, як реалізація принципу «нащадок є предком»;\n" +
                            "- Приватне успадкування – успадкування реалізації, з наданням іншого інтерфейсу;\n" +
                            "- Поліморфізм, віртуальні функції;\n" +
                            "- Абстрактні класи;\n" +
                            "- Принципи побудови ієрархії класів;\n" +
                            "- Паттерн проектування NVI (Non-Virtual Interface);\n" +
                            "- Ідіома «віртуального конструктора»;\n" +
                            "- Множинне успадкування, віртуальні базові класи;\n" +
                            "- Неявно створювані методи класу;\n" +
                            "- Узгодженість копіювання-створення-знищення-(переміщення для С++11);\n" +
                            "- Перевантаження операторів. Синтаксис і правила застосування;\n" +
                            "- Конструктори з одним аргументом, explicit;\n" +
                            "- Оператори неявного приведення типів.",
                    "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/OOP.svg/1280px-OOP.svg.png",
                    null, listOf(
                        Comment("15","Нарешті достпуно пояснили ООП.", "Катерина Іванченко")
                    ),
                    Date(System.currentTimeMillis() + 586400000)
                )
            ),
            listOf(
                Comment("16","Вітаю! Днями закінчив курс C ++. Що чекав від курсу? " +
                        "Можливість закласти якийсь фундамент у даному напрямку, " +
                        "щоб в подальшому була можливість, вивчаючи матеріал і практикуючись, рости." +
                        " Я вважаю, що мої надії виправдалися і я отримав бажане. Плюс до цього я познайомився з цікавими людьми," +
                        " з якими ми і осягали ази) Що стосується викладача, то ставлю великий, " +
                        "жирний плюс (Антон Водостоев). Людина є чинним програмістом з великим досвідом роботи." +
                        " Пояснить, розповість, покаже, аби \"посміхалися\". Спасибі хлопцям, які допомагали в " +
                        "проведенні занять. Людям, які в даний момент знаходяться на роздоріжжі, " +
                        "звичайно ж раджу пройти цей курс. Спасибі, був радий знайомству :)", "Ілля Боднаренко")
            ),
            "09-05-2021"
        )
    )
    add(
        Course(
            "8", "Python development",
            "Курс Python — комплексна програма навчання високорівневої мови програмування python (вимовляється «пайтон», але частіше – «пітон»).  Мова програмування python орієнтована на підвищення продуктивності фронтенда і читабельності його коду. Python простий у використанні, але в той же час його бібліотека налічує великий вибір корисних функцій, необхідних для створення веб-дизайну.",
            "https://mk0setscholarsn9sko6.kinstacdn.com/wp-content/uploads/2020/07/PythonProgramming.jpeg",
            "4.6", null, listOf(
                Lesson(
                    "8", "1", "Змінні, вирази і інструкції python", 140,
                    "Поняття «значення» і «тип»\n" +
                            "Змінні\n" +
                            "Імена змінних і ключові (зарезервовані) слова\n" +
                            "Оператори\n" +
                            "Оператори і операнди\n" +
                            "Вирази\n" +
                            "Порядок операцій\n" +
                            "Термінові операції\n" +
                            "Ввід даних",
                    "https://cdn.educba.com/academy/wp-content/uploads/2019/11/Python-Variables-.png",
                    null, listOf(
                        Comment("17","Урок дуже сподобався)", "Тимофій Микитюк")
                    ),
                    Date(System.currentTimeMillis() + 586400000)
                ),
                Lesson(
                    "9", "2", "Управління потоком виконання", 95,
                    "Логічні вирази\n" +
                            "Логічні оператори\n" +
                            "Умовне виконання\n" +
                            "Послідовність умов\n" +
                            "Вкладені умови\n" +
                            "Перехоплення винятків з використанням try і except\n" +
                            "Вправи",
                    "https://cdn.educba.com/academy/wp-content/uploads/2019/10/Do-While-Loop-in-Python-1.png",
                    null, listOf(
                        Comment("18", "Норм, але нудновато", "Таращук Олександр")
                    ),
                    Date(System.currentTimeMillis() + 686400000)
                )
            ),
            listOf(
                Comment("19",
                    "Добре структурована програма з великою кількістю прикладів і практичних завдань. " +
                            "Індивідуальний підхід до кожного з студентів плюс можна було ще поставити питання менторові " +
                            "(якщо щось було не зрозуміло). Так що рекомендую!)))", "Шинкаренко Тимофій")
            ),
            "31-05-2021"
        )
    )
}
